tiborsimon/embedded-tdd-headers/pic/pic18/pic18f26j50_tdd.h
#define T3CKPS0                       522
#define T3CKPS1                       523
#define TMR3CS0                       524
#define TMR3CS                        525
#define TMR3CS1                       526
#define T3RD16                        527
#define RD163                         528
#define TMR3L                         529
#define TMR3H                         530
#define BAUDCON2                      531
#define ABDEN2                        532
#define BAUDCON2_ABDEN                533
#define WUE2                          534
#define BAUDCON2_WUE                  535
#define BRG162                        536
#define BAUDCON2_BRG16                537
#define SCKP2                         538
#define TXCKP2                        539
#define BAUDCON2_TXCKP                540
#define DTRXP2                        541
#define RXDTP2                        542
#define BAUDCON2_RXDTP                543
#define RCMT2                         544
#define RCIDL2                        545
#define BAUDCON2_RCIDL                546
#define BAUDCON2_ABDOVF               547
#define ABDOVF2                       548
#define SPBRGH2                       549
#define BAUDCON1                      550
#define BAUDCON1_ABDEN                551
#define ABDEN1                        552
#define BAUDCON1_WUE                  553
#define WUE1                          554
#define W4E                           555
#define BRG161                        556
#define BAUDCON1_BRG16                557
#define CKTXP                         558
#define BAUDCON1_TXCKP                559
#define SCKP1                         560
#define TXCKP1                        561
#define SCKP                          562
#define DTRXP1                        563
#define RXDTP1                        564
#define DTRXP                         565
#define RXCKP                         566
#define BAUDCON1_RXDTP                567
#define RCMT1                         568
#define RCIDL1                        569
#define BAUDCON1_RCIDL                570
#define RCMT                          571
#define ABDOVF1                       572
#define BAUDCON1_ABDOVF               573
#define SPBRGH1                       574
#define PORTA                         575
#define C1INA                         576
#define AN0                           577
#define ULPWUIN                       578
#define ULPWU                         579
#define RP0                           580
#define RA0                           581
#define AN1                           582
#define RP1                           583
#define RA1                           584
#define C2INA                         585
#define CVREF_MINUS                   586
#define AN2                           587
#define RA2                           588
#define VREF_MINUS                    589
#define C2INB                         590
#define C1INB                         591
#define AN3                           592
#define VREF_PLUS                     593
#define RA3                           594
#define RCV                           595
#define AN4                           596
#define LVDIN                         597
#define NOT_SS1                       598
#define RP2                           599
#define RA5                           600
#define nSS1                          601
#define HLVDIN                        602
#define CLKO                          603
#define RA6                           604
#define OSC2                          605
#define CLKI                          606
#define RJPU                          607
#define RA7                           608
#define OSC1                          609
#define PORTB                         610
#define RB0                           611
#define INT0                          612
#define RP3                           613
#define AN12                          614
#define RB1                           615
#define RP4                           616
#define RTCC                          617
#define AN10                          618
#define REFO                          619
#define RP5                           620
#define AN8                           621
#define RB2                           622
#define CTEDG1                        623
#define VMO                           624
#define RP6                           625
#define AN9                           626
#define RB3                           627
#define VPO                           628
#define CCP2_PA2                      629
#define CTEDG2                        630
#define SCK1                          631
#define RB4                           632
#define RP7                           633
#define SCL1                          634
#define KBI0                          635
#define SDA1                          636
#define RB5                           637
#define RP8                           638
#define SDI1                          639
#define KBI1                          640
#define PGC                           641
#define RB6                           642
#define RP9                           643
#define KBI2                          644
#define PGD                           645
#define RB7                           646
#define RP10                          647
#define KBI3                          648
#define PORTC                         649
#define RP11                          650
#define T1OSO                         651
#define T1CK                          652
#define RC0                           653
#define CCP2                          654
#define NOT_UOE                       655
#define nUOE                          656
#define RP12                          657
#define T1OSI                         658
#define PA2                           659
#define RC1                           660
#define RP13                          661
#define CTPLS                         662
#define PA1                           663
#define RC2                           664
#define AN11                          665
#define D_MINUS                       666
#define VM                            667
#define RC4                           668
#define D_PLUS                        669
#define VP                            670
#define RC5                           671
#define RP17                          672
#define TX1                           673
#define RC6                           674
#define CK1                           675
#define SDO1                          676
#define RP18                          677
#define RX1                           678
#define RC7                           679
#define DT1                           680
#define HLVDCON                       681
#define HLVDL                         682
#define HLVDL0                        683
#define HLVDL1                        684
#define HLVDL2                        685
#define HLVDL3                        686
#define HLVDEN                        687
#define IRVST                         688
#define BGVST                         689
#define VDIRMAG                       690
#define DMACON2                       691
#define INTLVL0                       692
#define INTLVL                        693
#define INTLVL1                       694
#define INTLVL2                       695
#define INTLVL3                       696
#define DLYCYC                        697
#define DLYCYC0                       698
#define DLYCYC1                       699
#define DLYCYC2                       700
#define DLYCYC3                       701
#define DMACON1                       702
#define DMAEN                         703
#define DLYINTEN                      704
#define DUPLEX0                       705
#define DUPLEX1                       706
#define RXINC                         707
#define TXINC                         708
#define SSCON0                        709
#define SSCON1                        710
#define LATA                          711
#define LATA0                         712
#define LA0                           713
#define LATA1                         714
#define LA1                           715
#define LATA2                         716
#define LA2                           717
#define LATA3                         718
#define LA3                           719
#define LATA5                         720
#define LA5                           721
#define LATA6                         722
#define LA6                           723
#define LATA7                         724
#define LA7                           725
#define LATB                          726
#define LB0                           727
#define LATB0                         728
#define LB1                           729
#define LATB1                         730
#define LB2                           731
#define LATB2                         732
#define LB3                           733
#define LATB3                         734
#define LB4                           735
#define LATB4                         736
#define LB5                           737
#define LATB5                         738
#define LB6                           739
#define LATB6                         740
#define LB7                           741
#define LATB7                         742
#define LATC                          743
#define LATC0                         744
#define LC0                           745
#define LATC1                         746
#define LC1                           747
#define LATC2                         748
#define LC2                           749
#define LATC4                         750
#define LC4                           751
#define LATC5                         752
#define LC5                           753
#define LC6                           754
#define LATC6                         755
#define LATC7                         756
#define LC7                           757
#define ALRMVALL                      758
#define ALRMVALH                      759
#define ALRMRPT                       760
#define ARPT0                         761
#define ARPT                          762
#define ARPT1                         763
#define ARPT2                         764
#define ARPT3                         765
#define ARPT4                         766
#define ARPT5                         767
#define ARPT6                         768
#define ARPT7                         769
#define ALRMCFG                       770
#define ALRMPTR                       771
#define ALRMPTR0                      772
#define ALRMPTR1                      773
#define AMASK0                        774
#define AMASK                         775
#define AMASK1                        776
#define AMASK2                        777
#define AMASK3                        778
#define CHIME                         779
#define ALRMEN                        780
#define TRISA                         781
#define TRISA0                        782
#define TRISA1                        783
#define TRISA2                        784
#define TRISA3                        785
#define TRISA5                        786
#define TRISA6                        787
#define TRISA7                        788
#define TRISB                         789
#define TRISB0                        790
#define TRISB1                        791
#define TRISB2                        792
#define TRISB3                        793
#define TRISB4                        794
#define TRISB5                        795
#define TRISB6                        796
#define TRISB7                        797
#define TRISC                         798
#define TRISC0                        799
#define TRISC1                        800
#define TRISC2                        801
#define TRISC4                        802
#define TRISC5                        803
#define TRISC6                        804
#define TRISC7                        805
#define T3GCON                        806
#define T3GSS0                        807
#define T3GSS1                        808
#define T3GVAL                        809
#define T3GGO                         810
#define T3DONE                        811
#define T3GGO_T3DONE                  812
#define T3GSPM                        813
#define T3GTM                         814
#define T3GPOL                        815
#define TMR3GE                        816
#define RTCVALL                       817
#define WAITE0                        818
#define RTCVALH                       819
#define WAITE1                        820
#define WAITM0                        821
#define WAITM1                        822
#define WAITM2                        823
#define WAITM3                        824
#define WAITB0                        825
#define WAITB1                        826
#define T1GCON                        827
#define T1GSS0                        828
#define T1GSS1                        829
#define T1GVAL                        830
#define T1DONE                        831
#define T1GGO_T1DONE                  832
#define T1GGO                         833
#define T1GSPM                        834
#define T1GTM                         835
#define T1GPOL                        836
#define TMR1GE                        837
#define OSCTUNE                       838
#define TUN0                          839
#define TUN                           840
#define TUN1                          841
#define TUN2                          842
#define TUN3                          843
#define TUN4                          844
#define TUN5                          845
#define PLLEN                         846
#define INTSRC                        847
#define RCSTA2                        848
#define RCD82                         849
#define RX9D2                         850
#define RCSTA2_RX9D                   851
#define OERR2                         852
#define RCSTA2_OERR                   853
#define FERR2                         854
#define RCSTA2_FERR                   855
#define ADDEN2                        856
#define RCSTA2_ADDEN                  857
#define RCSTA2_CREN                   858
#define CREN2                         859
#define SREN2                         860
#define RCSTA2_SREN                   861
#define RC92                          862
#define RC8_92                        863
#define RCSTA2_RX9                    864
#define RX92                          865
#define RCSTA2_SPEN                   866
#define SPEN2                         867
#define PIE1                          868
#define TMR1IE                        869
#define TMR2IE                        870
#define CCP1IE                        871
#define SSP1IE                        872
#define SSPIE                         873
#define TXIE                          874
#define TX1IE                         875
#define RC1IE                         876
#define RCIE                          877
#define ADIE                          878
#define PIR1                          879
#define TMR1IF                        880
#define TMR2IF                        881
#define CCP1IF                        882
#define SSPIF                         883
#define SSP1IF                        884
#define TXIF                          885
#define TX1IF                         886
#define RCIF                          887
#define RC1IF                         888
#define ADIF                          889
#define IPR1                          890
#define TMR1IP                        891
#define TMR2IP                        892
#define CCP1IP                        893
#define SSPIP                         894
#define SSP1IP                        895
#define TX1IP                         896
#define TXIP                          897
#define RCIP                          898
#define RC1IP                         899
#define ADIP                          900
#define PIE2                          901
#define CCP2IE                        902
#define TMR3IE                        903
#define LVDIE                         904
#define BCL1IE                        905
#define BCLIE                         906
#define USBIE                         907
#define CM1IE                         908
#define CMIE                          909
#define CM2IE                         910
#define OSCFIE                        911
#define PIR2                          912
#define CCP2IF                        913
#define TMR3IF                        914
#define LVDIF                         915
#define BCL1IF                        916
#define BCLIF                         917
#define USBIF                         918
#define CM1IF                         919
#define CMIF                          920
#define CM2IF                         921
#define OSCFIF                        922
#define IPR2                          923
#define CCP2IP                        924
#define TMR3IP                        925
#define LVDIP                         926
#define BCLIP                         927
#define BCL1IP                        928
#define USBIP                         929
#define CM1IP                         930
#define CM2IP                         931
#define CMIP                          932
#define OSCFIP                        933
#define PIE3                          934
#define RTCCIE                        935
#define RXB0IE                        936
#define RXBNIE                        937
#define TMR3GIE                       938
#define RXB1IE                        939
#define CTMUIE                        940
#define TXB0IE                        941
#define TMR4IE                        942
#define TXB1IE                        943
#define TXB2IE                        944
#define TXBNIE                        945
#define TX2IE                         946
#define RC2IE                         947
#define BCL2IE                        948
#define SSP2IE                        949
#define PIR3                          950
#define RTCCIF                        951
#define RXBNIF                        952
#define TMR3GIF                       953
#define CTMUIF                        954
#define TMR4IF                        955
#define TXBNIF                        956
#define TX2IF                         957
#define RC2IF                         958
#define BCL2IF                        959
#define SSP2IF                        960
#define IPR3                          961
#define RTCCIP                        962
#define TMR3GIP                       963
#define RXBNIP                        964
#define CTMUIP                        965
#define TMR4IP                        966
#define TX2IP                         967
#define TXBNIP                        968
#define RC2IP                         969
#define BCL2IP                        970
#define SSP2IP                        971
#define EECON1                        972
#define WR                            973
#define WREN                          974
#define WRERR                         975
#define FREE                          976
#define WPROG                         977
#define EECON2                        978
#define TXSTA2                        979
#define TX9D2                         980
#define TXSTA2_TX9D                   981
#define TXD82                         982
#define TRMT2                         983
#define TXSTA2_TRMT                   984
#define BRGH2                         985
#define TXSTA2_BRGH                   986
#define SENDB2                        987
#define TXSTA2_SENDB                  988
#define TXSTA2_SYNC                   989
#define SYNC2                         990
#define TXEN2                         991
#define TXSTA2_TXEN                   992
#define TX8_92                        993
#define TX92                          994
#define TXSTA2_TX9                    995
#define TXSTA2_CSRC                   996
#define CSRC2                         997
#define TXREG2                        998
#define RCREG2                        999
#define SPBRG2                        1000
#define RCSTA1                        1001
#define RCSTA1_RX9D                   1002
#define RX9D1                         1003
#define RCD8                          1004
#define RCSTA1_OERR                   1005
#define OERR1                         1006
#define RCSTA1_FERR                   1007
#define FERR1                         1008
#define RCSTA1_ADDEN                  1009
#define ADDEN1                        1010
#define ADEN                          1011
#define RCSTA1_CREN                   1012
#define CREN1                         1013
#define SRENA                         1014
#define SREN1                         1015
#define RCSTA1_SREN                   1016
#define RC8_9                         1017
#define RCSTA1_RX9                    1018
#define nRC8                          1019
#define NOT_RC8                       1020
#define RC9                           1021
#define RX91                          1022
#define RCSTA1_SPEN                   1023
#define SPEN1                         1024
#define TXSTA1                        1025
#define TX9D1                         1026
#define TXSTA1_TX9D                   1027
#define TXD8                          1028
#define TRMT1                         1029
#define TXSTA1_TRMT                   1030
#define BRGH1                         1031
#define TXSTA1_BRGH                   1032
#define TXSTA1_SENDB                  1033
#define SENDB1                        1034
#define TXSTA1_SYNC                   1035
#define SYNC1                         1036
#define TXEN1                         1037
#define TXSTA1_TXEN                   1038
#define TX91                          1039
#define TX8_9                         1040
#define NOT_TX8                       1041
#define nTX8                          1042
#define TXSTA1_TX9                    1043
#define TXSTA1_CSRC                   1044
#define CSRC1                         1045
#define TXREG1                        1046
#define RCREG1                        1047
#define SPBRG1                        1048
#define CTMUICON                      1049
#define IRNG                          1050
#define IRNG0                         1051
#define IRNG1                         1052
#define ITRIM0                        1053
#define ITRIM                         1054
#define ITRIM1                        1055
#define ITRIM2                        1056
#define ITRIM3                        1057
#define ITRIM4                        1058
#define ITRIM5                        1059
#define CTMUCONL                      1060
#define EDG1STAT                      1061
#define EDG2STAT                      1062
#define EDG1SEL                       1063
#define EDG1SEL0                      1064
#define EDG1SEL1                      1065
#define EDG1POL                       1066
#define EDG2SEL0                      1067
#define EDG2SEL                       1068
#define EDG2SEL1                      1069
#define EDG2POL                       1070
#define CTMUCONH                      1071
#define CTTRIG                        1072
#define IDISSEN                       1073
#define EDGSEQEN                      1074
#define EDGEN                         1075
#define TGEN                          1076
#define CTMUSIDL                      1077
#define CTMUEN                        1078
#define CCP2CON                       1079
#define CCP2M                         1080
#define CCP2M0                        1081
#define CCP2M1                        1082
#define CCP2M2                        1083
#define CCP2M3                        1084
#define DC2B                          1085
#define DC2B0                         1086
#define CCP2Y                         1087
#define DC2B1                         1088
#define CCP2X                         1089
#define P2M                           1090
