tiborsimon/embedded-tdd-headers/pic/pic18/pic18f26j50_tdd.h
#define P2M0                          1091
#define P2M1                          1092
#define CCPR2L                        1093
#define CCPR2H                        1094
#define ECCP2DEL                      1095
#define ECCP2DEL_P2DC0                1096
#define P2DC                          1097
#define ECCP2DEL_P2DC1                1098
#define ECCP2DEL_P2DC2                1099
#define ECCP2DEL_P2DC3                1100
#define ECCP2DEL_P2DC4                1101
#define ECCP2DEL_P2DC5                1102
#define ECCP2DEL_P2DC6                1103
#define P2RSEN                        1104
#define PSS2BD                        1105
#define PSS2BD0                       1106
#define PSS2BD1                       1107
#define PSS2AC0                       1108
#define PSS2AC                        1109
#define PSS2AC1                       1110
#define ECCP2AS0                      1111
#define ECCP2AS                       1112
#define ECCP2AS1                      1113
#define ECCP2AS2                      1114
#define ECCP2ASE                      1115
#define PSTR2CON                      1116
#define PSTR2CON_STRA                 1117
#define P2DC02                        1118
#define STRA2                         1119
#define P2DC0CON                      1120
#define PSTR2CON_P2DC0                1121
#define STRB2                         1122
#define P2DC12                        1123
#define PSTR2CON_STRB                 1124
#define PSTR2CON_P2DC1                1125
#define P2DC1CON                      1126
#define PSTR2CON_STRC                 1127
#define STRC2                         1128
#define PSTR2CON_P2DC2                1129
#define P2DC22                        1130
#define P2DC2CON                      1131
#define P2DC32                        1132
#define STRD2                         1133
#define PSTR2CON_STRD                 1134
#define P2DC3CON                      1135
#define PSTR2CON_P2DC3                1136
#define P2DC4CON                      1137
#define STRSYNC2                      1138
#define PSTR2CON_STRSYNC              1139
#define PSTR2CON_P2DC4                1140
#define P2DC42                        1141
#define P2DC52                        1142
#define P2DC5CON                      1143
#define PSTR2CON_P2DC5                1144
#define P2DC6CON                      1145
#define CMPL02                        1146
#define PSTR2CON_P2DC6                1147
#define P2DC62                        1148
#define PSTR2CON_CMPL0                1149
#define CMPL12                        1150
#define PSTR2CON_CMPL1                1151
#define CCP1CON                       1152
#define CCP1M0                        1153
#define CCP1M                         1154
#define CCP1M1                        1155
#define CCP1M2                        1156
#define CCP1M3                        1157
#define CCP1Y                         1158
#define DC1B                          1159
#define DC1B0                         1160
#define CCP1X                         1161
#define DC1B1                         1162
#define P1M                           1163
#define P1M0                          1164
#define P1M1                          1165
#define CCPR1L                        1166
#define CCPR1H                        1167
#define ECCP1DEL                      1168
#define P1DC                          1169
#define P1DC0                         1170
#define P1DC1                         1171
#define P1DC2                         1172
#define P1DC3                         1173
#define P1DC4                         1174
#define P1DC5                         1175
#define P1DC6                         1176
#define P1RSEN                        1177
#define PSS1BD0                       1178
#define PSS1BD                        1179
#define PSS1BD1                       1180
#define PSS1AC                        1181
#define PSS1AC0                       1182
#define PSS1AC1                       1183
#define ECCP1AS                       1184
#define ECCP1AS0                      1185
#define ECCP1AS1                      1186
#define ECCP1AS2                      1187
#define ECCP1ASE                      1188
#define PSTR1CON                      1189
#define PSTR1CON_STRA                 1190
#define PSTR1CON_STRB                 1191
#define PSTR1CON_STRC                 1192
#define PSTR1CON_STRD                 1193
#define PSTR1CON_STRSYNC              1194
#define PSTR1CON_CMPL0                1195
#define PSTR1CON_CMPL1                1196
#define WDTCON                        1197
#define SWDTEN                        1198
#define SWDTE                         1199
#define ULPSINK                       1200
#define ULPEN                         1201
#define DS                            1202
#define ULPLVL                        1203
#define LVDSTAT                       1204
#define REGSLP                        1205
#define ADCON1                        1206
#define ADCS0                         1207
#define ADCS                          1208
#define ADCS1                         1209
#define ADCS2                         1210
#define ACQT0                         1211
#define ACQT                          1212
#define CHSN3                         1213
#define ACQT1                         1214
#define VCFG01                        1215
#define ACQT2                         1216
#define VCFG11                        1217
#define ADCON1_ADCAL                  1218
#define ADFM                          1219
#define ADCON0                        1220
#define ADON                          1221
#define nDONE                         1222
#define GO_nDONE                      1223
#define NOT_DONE                      1224
#define GODONE                        1225
#define GO_DONE                       1226
#define DONE                          1227
#define GO                            1228
#define GO_NOT_DONE                   1229
#define CHS                           1230
#define CHS0                          1231
#define CHS1                          1232
#define CHS2                          1233
#define CHS3                          1234
#define VCFG                          1235
#define VCFG0                         1236
#define VCFG1                         1237
#define ADCON0_ADCAL                  1238
#define ADRESL                        1239
#define ADRESH                        1240
#define SSP1CON2                      1241
#define SEN1                          1242
#define SSP1CON2_SEN                  1243
#define ADMSK11                       1244
#define SSP1CON2_RSEN                 1245
#define RSEN1                         1246
#define SSP1CON2_ADMSK1               1247
#define SSP1CON2_PEN                  1248
#define ADMSK21                       1249
#define PEN1                          1250
#define SSP1CON2_ADMSK2               1251
#define ADMSK31                       1252
#define RCEN1                         1253
#define SSP1CON2_RCEN                 1254
#define SSP1CON2_ADMSK3               1255
#define SSP1CON2_ACKEN                1256
#define ACKEN1                        1257
#define ADMSK41                       1258
#define SSP1CON2_ADMSK4               1259
#define ACKDT1                        1260
#define ADMSK51                       1261
#define SSP1CON2_ACKDT                1262
#define SSP1CON2_ADMSK5               1263
#define SSP1CON2_ACKSTAT              1264
#define ACKSTAT1                      1265
#define GCEN1                         1266
#define SSP1CON2_GCEN                 1267
#define SSP1CON1                      1268
#define SSP1CON1_SSPM0                1269
#define SSPM01                        1270
#define SSP1CON1_SSPM                 1271
#define SSP1CON1_SSPM1                1272
#define SSPM11                        1273
#define SSP1CON1_SSPM2                1274
#define SSPM21                        1275
#define SSPM31                        1276
#define SSP1CON1_SSPM3                1277
#define SSP1CON1_CKP                  1278
#define CKP1                          1279
#define SSPEN1                        1280
#define SSP1CON1_SSPEN                1281
#define SSPOV1                        1282
#define SSP1CON1_SSPOV                1283
#define WCOL1                         1284
#define SSP1CON1_WCOL                 1285
#define SSP1STAT                      1286
#define BF1                           1287
#define SSP1STAT_BF                   1288
#define SSP1STAT_UA                   1289
#define UA1                           1290
#define SSP1STAT_R_NOT_W              1291
#define RW1                           1292
#define R_nW1                         1293
#define READ_WRITE                    1294
#define R_NOT_W1                      1295
#define NOT_W                         1296
#define I2C_READ                      1297
#define D_A1                          1298
#define nW                            1299
#define NOT_W1                        1300
#define READ_WRITE1                   1301
#define RW                            1302
#define nW1                           1303
#define SSP1STAT_R_nW                 1304
#define R1                            1305
#define nWRITE1                       1306
#define I2C_READ1                     1307
#define nWRITE                        1308
#define R                             1309
#define NOT_WRITE                     1310
#define R_W                           1311
#define NOT_WRITE1                    1312
#define SSP1STAT_S                    1313
#define S1                            1314
#define START                         1315
#define START1                        1316
#define I2C_START1                    1317
#define I2C_START                     1318
#define SSP1STAT_P                    1319
#define STOP1                         1320
#define I2C_STOP                      1321
#define P1                            1322
#define I2C_STOP1                     1323
#define STOP                          1324
#define D_nA1                         1325
#define NOT_A                         1326
#define SSP1STAT_D_nA                 1327
#define SSP1STAT_D_NOT_A              1328
#define DA                            1329
#define DATA_ADDRESS1                 1330
#define nA                            1331
#define D_A                           1332
#define nADDRESS1                     1333
#define D                             1334
#define DA1                           1335
#define NOT_A1                        1336
#define NOT_ADDRESS1                  1337
#define DATA_ADDRESS                  1338
#define I2C_DAT1                      1339
#define NOT_ADDRESS                   1340
#define nADDRESS                      1341
#define R_W1                          1342
#define nA1                           1343
#define I2C_DAT                       1344
#define D_NOT_A1                      1345
#define D1                            1346
#define CKE1                          1347
#define SSP1STAT_CKE                  1348
#define SMP1                          1349
#define SSP1STAT_SMP                  1350
#define SSP1ADD                       1351
#define SSP1ADD_SSPADD                1352
#define SSP1ADD_MSK0                  1353
#define MSK01                         1354
#define SSP1ADD_MSK1                  1355
#define MSK11                         1356
#define SSP1ADD_MSK2                  1357
#define MSK21                         1358
#define MSK31                         1359
#define SSP1ADD_MSK3                  1360
#define SSP1ADD_MSK4                  1361
#define MSK41                         1362
#define MSK51                         1363
#define SSP1ADD_MSK5                  1364
#define SSP1ADD_MSK6                  1365
#define MSK61                         1366
#define MSK71                         1367
#define SSP1ADD_MSK7                  1368
#define SSP1BUF                       1369
#define SSP1BUF_SSPBUF                1370
#define T2CON                         1371
#define T2CKPS0                       1372
#define T2CKPS                        1373
#define T2CKPS1                       1374
#define TMR2ON                        1375
#define T2OUTPS0                      1376
#define T2OUTPS                       1377
#define T2OUTPS1                      1378
#define T2OUTPS2                      1379
#define T2OUTPS3                      1380
#define WM0                           1381
#define PR2                           1382
#define WM1                           1383
#define WAIT0                         1384
#define WAIT1                         1385
#define EBDIS                         1386
#define TMR2                          1387
#define T1CON                         1388
#define TMR1ON                        1389
#define T1CON_RD16                    1390
#define RD161                         1391
#define T1SYNC                        1392
#define T1SYNC1                       1393
#define T1OSCEN                       1394
#define T1OSCEN1                      1395
#define SOSCEN                        1396
#define T1CKPS0                       1397
#define T1CKPS01                      1398
#define T1CKPS                        1399
#define T1CKPS1                       1400
#define T1CKPS11                      1401
#define TMR1CS0                       1402
#define TMR1CS                        1403
#define TMR1CS01                      1404
#define T1RD16                        1405
#define TMR1CS11                      1406
#define TMR1CS1                       1407
#define TMR1L                         1408
#define TMR1H                         1409
#define RCON                          1410
#define BOR                           1411
#define NOT_BOR                       1412
#define nBOR                          1413
#define POR                           1414
#define nPOR                          1415
#define NOT_POR                       1416
#define PD                            1417
#define nPD                           1418
#define NOT_PD                        1419
#define nTO                           1420
#define TO                            1421
#define NOT_TO                        1422
#define nRI                           1423
#define NOT_RI                        1424
#define RI                            1425
#define NOT_CM                        1426
#define CM                            1427
#define nCM                           1428
#define IPEN                          1429
#define CM2CON                        1430
#define CM2CON_CCH                    1431
#define CM2CON_CCH0                   1432
#define CCH02                         1433
#define CCH12                         1434
#define CM2CON_CCH1                   1435
#define CM2CON_CREF                   1436
#define CREF2                         1437
#define CM2CON_EVPOL                  1438
#define EVPOL02                       1439
#define CM2CON_EVPOL0                 1440
#define EVPOL12                       1441
#define CM2CON_EVPOL1                 1442
#define CM2CON_CPOL                   1443
#define CPOL2                         1444
#define CM2CON_COE                    1445
#define COE2                          1446
#define CM2CON_CON                    1447
#define CON2                          1448
#define CM1CON                        1449
#define CM1CON_CCH                    1450
#define C1CH0                         1451
#define CM1CON_CCH0                   1452
#define CCH01                         1453
#define CCH11                         1454
#define C1CH1                         1455
#define CM1CON_CCH1                   1456
#define CM1CON_CREF                   1457
#define CREF1                         1458
#define EVPOL01                       1459
#define CM1CON_EVPOL0                 1460
#define CM1CON_EVPOL                  1461
#define CM1CON_EVPOL1                 1462
#define EVPOL11                       1463
#define CM1CON_CPOL                   1464
#define CPOL1                         1465
#define CM1CON_COE                    1466
#define COE1                          1467
#define CM1CON_CON                    1468
#define CON1                          1469
#define OSCCON                        1470
#define SCS0                          1471
#define SCS                           1472
#define SCS1                          1473
#define OSTS                          1474
#define IRCF                          1475
#define IRCF0                         1476
#define IRCF1                         1477
#define IRCF2                         1478
#define IDLEN                         1479
#define T0CON                         1480
#define T0PS                          1481
#define T0PS0                         1482
#define T0PS1                         1483
#define T0PS2                         1484
#define PSA                           1485
#define T0SE                          1486
#define T0CS                          1487
#define T08BIT                        1488
#define TMR0ON                        1489
#define TMR0L                         1490
#define TMR0H                         1491
#define STATUS                        1492
#define C                             1493
#define CARRY                         1494
#define DC                            1495
#define ZERO                          1496
#define Z                             1497
#define OV                            1498
#define OVERFLOW                      1499
#define N                             1500
#define NEGATIVE                      1501
#define FSR2L                         1502
#define PLUSW2                        1503
#define PREINC2                       1504
#define POSTDEC2                      1505
#define POSTINC2                      1506
#define INDF2                         1507
#define FSR1L                         1508
#define PLUSW1                        1509
#define PREINC1                       1510
#define POSTDEC1                      1511
#define POSTINC1                      1512
#define INDF1                         1513
#define WREG                          1514
#define FSR0L                         1515
#define PLUSW0                        1516
#define PREINC0                       1517
#define POSTDEC0                      1518
#define POSTINC0                      1519
#define INDF0                         1520
#define INTCON3                       1521
#define INT1IF                        1522
#define INT1F                         1523
#define INT2IF                        1524
#define INT2F                         1525
#define INT3F                         1526
#define INT3IF                        1527
#define INT1E                         1528
#define INT1IE                        1529
#define INT2IE                        1530
#define INT2E                         1531
#define INT3E                         1532
#define INT3IE                        1533
#define INT1P                         1534
#define INT1IP                        1535
#define INT2IP                        1536
#define INT2P                         1537
#define INTCON2                       1538
#define RBIP                          1539
#define INT3IP                        1540
#define INT3P                         1541
#define TMR0IP                        1542
#define T0IP                          1543
#define INTEDG3                       1544
#define INTEDG2                       1545
#define INTEDG1                       1546
#define INTEDG0                       1547
#define RBPU                          1548
#define NOT_RBPU                      1549
#define nRBPU                         1550
#define INTCON                        1551
#define RBIF                          1552
#define INT0F                         1553
#define INT0IF                        1554
#define T0IF                          1555
#define TMR0IF                        1556
#define RBIE                          1557
#define INT0E                         1558
#define INT0IE                        1559
#define T0IE                          1560
#define TMR0IE                        1561
#define PEIE                          1562
#define PEIE_GIEL                     1563
#define GIEL                          1564
#define GIE_GIEH                      1565
#define GIE                           1566
#define GIEH                          1567
#define PRODL                         1568
#define PRODH                         1569
#define TABLAT                        1570
#define TBLPTRL                       1571
#define TBLPTRH                       1572
#define PCL                           1573
#define PCLATH                        1574
#define PCH                           1575
#define SP0                           1576
#define STKPTR                        1577
#define SP1                           1578
#define SP2                           1579
#define SP3                           1580
#define SP4                           1581
#define STKUNF                        1582
#define STKOVF                        1583
#define STKFUL                        1584
#define TOSL                          1585
#define TOSH                          1586

#endif // _PIC18F26J50_H_
